Documents/ОтправкаПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ОтправкаПисем</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДанныеДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ДанныеДоговоров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегоЗадолженность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныйОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Неустойка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчетаЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Адреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Адреса</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Должники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтверждение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПодтверждениеДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРегиона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРайона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипГорода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНаселенногоПункта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУлицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКорпусаСтроения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорпусСтроение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдмОкруг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонГорода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Должники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Должники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКогдаВыдан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Новый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегионаФССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СудебныеСтатусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСудСтатус</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ОтправкаПисем/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Об = РеквизитФормыВЗначение("Объект");
	Если Об.ЭтоНовый() Тогда
		Объект.Автор = ПараметрыСеанса.Пользователь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДолжников(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьТЧДолжники", ЭтотОбъект);	
	ОткрытьФорму("Обработка.ЗагрузкаДолжников.Форма.Форма",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧДолжники(Результат, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		Для каждого строкаРезультата Из Результат Цикл
			НоваяСтрока = Объект.Должники.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, строкаРезультата);
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьТЧДоллжники()

&НаКлиенте
Процедура ОбработкаКомандФормы(Команда)
	Если Команда.Имя = "ТаблицаДанныхПодстановки" Тогда
		ТабДок = ПечатьТаблицаДанныхПодстановки();
		ИмяФайла = СтрШаблон("Таблица данных подстановки. Отправка писем № %1 от %2.xls", Объект.Номер, Формат(Объект.Дата, "ДЛФ=D"));
		ТабДок.Показать("Таблица данных подстановки", ИмяФайла);
	ИначеЕсли Команда.Имя = "ПечатьУведомление" Тогда
		ПечатьПоМакету("Уведомление");
	ИначеЕсли Команда.Имя = "ДолжникиПечатьТребование" Тогда
		ПечатьПоМакету("Требование");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПоМакету(ИмяМакета)
	Если Объект.Проведен = Ложь Тогда
		ПоказатьПредупреждение(, "Подготовка писем возможна только для проведённого документа.", 60);
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.ТипАдреса) = Ложь Тогда
		ПоказатьПредупреждение(, "Не выбран тип адреса.", 60);
		Возврат;
	КонецЕсли; 
	
	Макет = ПолучитьМакетПоИмени(ИмяМакета);

	ИмяФайлаМакета = ПолучитьИмяВременногоФайла("doc");
	Макет.Записать(ИмяФайлаМакета);
	Ворд = Новый COMОбъект("Word.Application");

	//Ворд = ПолучитьCOMОбъект(ИмяФайлаМакета);//Макет.Получить();
	
	// Инициализация MS Word
	Попытка
		Документ = Ворд.Documents.Add(ИмяФайлаМакета);
		//Документ = Ворд.Application.Documents(1);
		Документ.Activate();
		
		// Заполнение шаблона	
		Замена = Документ.Content.Find;
		Selection = Ворд.Application.Selection;
		
		Состояние("Запрос данных по договорам..");
		
		МассивДолжников = ПолучитьДанныеДляЗаполнения();
		
		Selection.WholeStory();
		Selection.Copy();
		
		НомерПП = 0;
		Для каждого СтруктураДанных Из МассивДолжников Цикл
			НомерПП = НомерПП + 1;
			// Добавить копию страницы
			Если НомерПП > 1 Тогда
				Selection.EndKey(6); // wdStory = 6
				Selection.InsertBreak(7); // wdPageBreak = 7
				Selection.PasteAndFormat(0); // wdPasteDefault
			КонецЕсли;
			
			Если Ложь Тогда СтруктураДанных = Новый Структура; КонецЕсли; 
			Для каждого ключСтруктуры Из СтруктураДанных Цикл
				ИмяКлюча = СтрШаблон("<%1>", ключСтруктуры.Ключ);
				Замена(Selection, Замена, ИмяКлюча, ключСтруктуры.Значение);
			КонецЦикла; 
		КонецЦикла; 
		
		
		Ворд.Application.Visible = Истина;
		Ворд.Activate();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Возможно, на данном компьютере не установлен MS Word. (Описание ошибки :" + ОписаниеОшибки() + ")");
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетПоИмени(ИмяМакета)
	Об = РеквизитФормыВЗначение("Объект");
	Макет = Об.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
КонецФункции // ()

&НаСервере
Функция ПечатьТаблицаДанныхПодстановки()
	
	Макет = Документы.ОтправкаПисем.ПолучитьМакет("ТаблицаДанныхПодстановки");
	
	// Получить данные по договорам
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеДоговоровСрезПоследних.Договор КАК Договор,
	|	ДанныеДоговоровСрезПоследних.ТекущийОсновнойДолг КАК ТекущийОсновнойДолг,
	|	ДанныеДоговоровСрезПоследних.ВсегоЗадолженность КАК ВсегоЗадолженность,
	|	ДанныеДоговоровСрезПоследних.ПросроченныеПроценты КАК ПросроченныеПроценты,
	|	ДанныеДоговоровСрезПоследних.ПросроченныйОсновнойДолг КАК ПросроченныйОсновнойДолг,
	|	ДанныеДоговоровСрезПоследних.Неустойка КАК Неустойка,
	|	ДанныеДоговоровСрезПоследних.ДатаРасчетаЗадолженности КАК ДатаРасчетаЗадолженности,
	|	ДанныеДоговоровСрезПоследних.ДнейПросрочки КАК ДнейПросрочки,
	|	ДанныеДоговоровСрезПоследних.Договор.Банк КАК Банк,
	|	ДанныеДоговоровСрезПоследних.Договор.НомерДоговора КАК НомерДоговора,
	|	ДанныеДоговоровСрезПоследних.Договор.ДатаФинансирования КАК ДатаФинансирования,
	|	ДанныеДоговоровСрезПоследних.Договор.Владелец КАК Должник,
	|	ДанныеДоговоровСрезПоследних.Договор.СуммаКредита КАК СуммаКредита,
	|	ВложенныйЗапрос.Адрес КАК Адрес
	|ИЗ
	|	РегистрСведений.ДанныеДоговоров.СрезПоследних(&Момент, Договор.Владелец В (&СписокДолжников)) КАК ДанныеДоговоровСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Адреса.Ссылка КАК Адрес,
	|			Адреса.Владелец КАК Должник
	|		ИЗ
	|			Справочник.Адреса КАК Адреса
	|		ГДЕ
	|			Адреса.Тип = &ТипАдреса) КАК ВложенныйЗапрос
	|		ПО ДанныеДоговоровСрезПоследних.Договор.Владелец = ВложенныйЗапрос.Должник
	|
	|УПОРЯДОЧИТЬ ПО
	|	Должник";
	
	Запрос.УстановитьПараметр("Момент", Объект.Дата);
	Запрос.УстановитьПараметр("СписокДолжников", Объект.Должники.ВыгрузитьКолонку("Должник"));
	Запрос.УстановитьПараметр("ТипАдреса", Объект.ТипАдреса);
	
	Результат = Запрос.Выполнить();
	ВыборкаДетали = Результат.Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	Пока ВыборкаДетали.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетали.Уровень());
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура Замена(Selection, Замена, Тег, Знач Значение)
	Значение = Строка(Значение);
	// Execute(	FindText, MatchCase, MatchWholeWord, MatchWildcards, 
	// 			MatchSoundsLike, MatchAllWordForms, Forward, Wrap, 
	//			Format, ReplaceWith, Replace, MatchKashida, MatchDiacritics, 
	//			MatchAlefHamza, MatchControl)
	//Замена.Execute(Тег, Ложь, Истина, Ложь,,, Истина,1, Ложь, Значение, 2);
	Selection.GoTo(1, 3, 1, ""); // wdGoToPage = 1, wdGoToPrevious = 3
	Замена.Execute(Тег, Ложь, Истина, Ложь,,, Истина,, Ложь, Значение, 2);
КонецПроцедуры

&НаКлиенте
Процедура ВНачалоСтраницы(Selection)
	
	Selection.GoTo(1, 3, 1, ""); // wdGoToPage = 1, wdGoToPrevious = 3
	//Selection.GoTo(1, 2, 1, ""); // wdGoToPage = 1, wdGoToNext = 2
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляЗаполнения()
	МассивРезультатов = Новый Массив;
	
	// Получить данные по договорам
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеДоговоровСрезПоследних.Договор КАК Договор,
	               |	ДанныеДоговоровСрезПоследних.ТекущийОсновнойДолг КАК ТекущийОсновнойДолг,
	               |	ДанныеДоговоровСрезПоследних.ВсегоЗадолженность КАК СуммаВсего,
	               |	ДанныеДоговоровСрезПоследних.ПросроченныеПроценты КАК ПросроченныеПроценты,
	               |	ДанныеДоговоровСрезПоследних.ПросроченныйОсновнойДолг КАК ПросроченнаяЗадолженность,
	               |	ДанныеДоговоровСрезПоследних.Неустойка КАК Неустойка,
	               |	ДанныеДоговоровСрезПоследних.ДатаРасчетаЗадолженности КАК ДатаРасчетаЗадолженности,
	               |	ДанныеДоговоровСрезПоследних.ДнейПросрочки КАК ДнейПросрочки,
	               |	ДанныеДоговоровСрезПоследних.Договор.Банк КАК Банк,
	               |	ДанныеДоговоровСрезПоследних.Договор.НомерДоговора КАК НомерДоговора,
	               |	ДанныеДоговоровСрезПоследних.Договор.ДатаФинансирования КАК ДатаДоговора,
	               |	ДанныеДоговоровСрезПоследних.Договор.Владелец КАК Должник,
	               |	ДанныеДоговоровСрезПоследних.Договор.СуммаКредита КАК СуммаКредита,
	               |	ВложенныйЗапрос.Адрес КАК АдресДолжника,
	               |	ДанныеДоговоровСрезПоследних.ТекущиеПроценты КАК ТекущиеПроценты,
	               |	ДанныеДоговоровСрезПоследних.Госпошлина КАК Госпошлина,
	               |	ДанныеДоговоровСрезПоследних.Прочее КАК Прочее,
	               |	Должники.Фамилия КАК Фамилия,
	               |	Должники.Имя КАК Имя,
	               |	Должники.Отчество КАК Отчество,
	               |	Должники.Наименование КАК ФИО,
	               |	Должники.Имя + "" "" + Должники.Отчество КАК ИО,
	               |	&ТекущаяДата КАК ТекущаяДата
	               |ИЗ
	               |	РегистрСведений.ДанныеДоговоров.СрезПоследних(&Момент, Договор.Владелец В (&СписокДолжников)) КАК ДанныеДоговоровСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Адреса.Ссылка КАК Адрес,
	               |			Адреса.Владелец КАК Должник
	               |		ИЗ
	               |			Справочник.Адреса КАК Адреса
	               |		ГДЕ
	               |			Адреса.Тип = &ТипАдреса) КАК ВложенныйЗапрос
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должники КАК Должники
	               |			ПО ВложенныйЗапрос.Должник = Должники.Ссылка
	               |		ПО ДанныеДоговоровСрезПоследних.Договор.Владелец = ВложенныйЗапрос.Должник
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Должник";
	СписокДолжников = Объект.Должники.Выгрузить(,"Должник").ВыгрузитьКолонку("Должник");
	Запрос.УстановитьПараметр("Момент", Объект.Дата);
	Запрос.УстановитьПараметр("СписокДолжников", СписокДолжников);
	Запрос.УстановитьПараметр("ТипАдреса", Объект.ТипАдреса);
	Запрос.УстановитьПараметр("ТекущаяДата", Формат(ТекущаяДатаСеанса(), "ДЛФ=D"));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураВозврата = Новый Структура("ФИО, Банк, ИО, НомерДоговора, ДатаДоговора, СуммаВсего, ПросроченнаяЗадолженность, АдресДолжника, ТекущаяДата");
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
		МассивРезультатов.Добавить(СтруктураВозврата);
	КонецЦикла;
	
	Возврат МассивРезультатов;
КонецФункции
